---
kind: property
id: P:Autodesk.Revit.DB.Plane.YVec
source: html/b1acdb7b-b830-8adc-fb01-fd809c21d310.htm
---
# Autodesk.Revit.DB.Plane.YVec Property

Axis defining the second parametric direction of the plane.

## Syntax (C#)
```csharp
public XYZ YVec { get; }
```